{"TIM COOK":"The Apple CEO came out publicly as gay—and as a person of faith—In a October 2014 letter to Bloomsberg Business.  “I’m proud to be gay,” he declared, “and I consider being gay among the greatest gifts God has given me.”  As the head of one of the world’s largest and most important corporations, Cook challenged the hetero-driven mythos of big business. “If hearing that the CEO of Apple is gay can help someone struggling to come to terms with who he or she is, or bring comfort to anyone who feels alone, or inspire people to insist on their equality, then it’s worth the trade-off with my own privacy.”","TY HERNDON":"After nearly two decades in country music, the “What Mattered Most” singer decided to come out in an Entertainment Tonight interview in November 2014. His announcement, coming on the heels of Kacey Musgraves progressive chart-topper “Follow Your Arrow,” started an important conversation about what it means to be a male country singer in Nashville.  “Traditionally in country music, we don’t see a lot of support for the LGBT community, but that’s changing so much,” he said. “Nashville is changing so much.”  Though the genre has a long way to go in regards to LGBT representation, Herndon’s coming out was a big and impactful step. ","BILLY GILMAN":"Just days after Herndon, fellow country music singer Billy Gilman released a coming out video  on YouTube.      It’s an emotional confession, addressing his fears of coming out in a traditionally conservative scene. “It’s pretty silly to know that I’m ashamed of doing this—because I’m in a genre and industry that is ashamed of me for being me.” ","JUSSIE SMOLLETT":"In March Empire heartthrob Jussie Smollett confirmed that he was gay to Ellen DeGeneres, saying, “there’s never been a closet that I’ve been in.”  Smollett added that, though he wasn’t interested in exposing his private life, he wanted to make a statement “so that people understood that they’re not alone.”  In a case of art imitating life, Smollet’s Empire character, Jamal Lyon, also had a coming out this year, though arguably in a much showier fashion. ","JOEL GREY":"Though Grey had been out to his friends and family for years, the 82-year-old Broadway legend finally made it official in a January interview with People magazine. The Cabaret star confided that he’d been nervous about it his whole life, citing conversations he’d overhear between his parents when he was younger: “[they’d talk] derisively about ‘fairies’ and men being dragged off to jail, and even worse, for being who they were.” ","MILEY CYRUS":"It’s been a big year for Miley, especially in regards to her involvement with the LGBT community: She founded the Happy Hippie Foundation to rally young people to fight the injustices facing homeless and LGBT youth, danced with some of our favorite RPDR queens at the 2015 VMAs and, in August, came out as pansexual   Jerris Madison, Tate Tulier   . “I’m very open about it,” she told Elle UK. “But I’m not in a relationship. I’m 22, I’m going on dates but I change my style every two weeks, let alone who I’m with.” ","SHANE DAWSON":"The 26-year-old YouTube star, who has more than 6.7 million subscribers, came out as bisexual in a teary video confessional in July.  “Over the last year I have been extremely sexually confused,” he explained. “I mean my whole life, but this last year is when it really hit me.” ","ISRAEL GUTIERREZ":"In September, the ESPN commentator came out as both gay and engaged in a moving blog post. “The only way to truly understand [what we go through] is to live in our shoes, which is impossible. Short of that, sharing our experiences is the best way to potentially break through and help people understand.”  Two weeks after posting his statement online, Gutierrez and fiance David Kitchen tied the knot. ","KEEGAN HIRST":"Hirst made headlines in August when he came out as the first openly gay British rugby player. The team captain and father of two admitted that the biggest roadblock to the acceptance of his sexuality was a deeply-embedded cultural denial: “Society dictates that when you’re a 16-year-old lad you have a girlfriend, you sleep with her and that’s how it is. Especially as a rugby player and a lad who grew up on a council estate… I convinced myself, no way could I be gay, it was inconceivable.” But now that he’s embraced his true self, Hirst feels as though he’s “letting out a long breath that [he’s] held in for a long time.” ","JANAE KROC":"The world record-holding bodybuilder came out as a trans woman on Istagram, describing her identity as “Alpha male/girly girl Lesbian in a male body”. Though she hasn’t decided yet if she’s going to fully transition and live her life as a woman, she’s boldly accepting her trans identity while shutting down naysayers who assumed her instagram post was a hoax: “This is really me and yes I am transgender…one does not ’become’ transgender, you are or you aren’t.” ","NYLE DIMARCO":"The America’s Next Top Model recently announced on Twitter that he was sexually fluid. While we realize that doesn’t really increase our chances of making him our boyfriend, we still welcome him to the family.","MR. SMITHERS":"It was announced last month that the beloved Simpsons  sycophant would come out in a two-part episode this season. Even Maggie saw that one coming. "}