{"TIM COOK":"The Apple CEO came out publicly as gay—and as a person of faith—In a October 2014 letter to Bloomsberg Business.  “I’m proud to be gay,” he declared, “and I consider being gay among the greatest gifts God has given me.”  As the head of one of the world’s largest and most important corporations, Cook challenged the hetero-driven mythos of big business. “If hearing that the CEO of Apple is gay can help someone struggling to come to terms with who he or she is, or bring comfort to anyone who feels alone, or inspire people to insist on their equality, then it’s worth the trade-off with my own privacy.”","TY HERNDON":"After nearly two decades in country music, the “What Mattered Most” singer decided to come out in an Entertainment Tonight interview in November 2014. His announcement, coming on the heels of Kacey Musgraves progressive chart-topper “Follow Your Arrow,” started an important conversation about what it means to be a male country singer in Nashville.  “Traditionally in country music, we don’t see a lot of support for the LGBT community, but that’s changing so much,” he said. “Nashville is changing so much.”  Though the genre has a long way to go in regards to LGBT representation, Herndon’s coming out was a big and impactful step. ","BILLY GILMAN":"Just days after Herndon, fellow country music singer Billy Gilman released a coming out video  on YouTube.      It’s an emotional confession, addressing his fears of coming out in a traditionally conservative scene. “It’s pretty silly to know that I’m ashamed of doing this—because I’m in a genre and industry that is ashamed of me for being me.” ","JUSSIE SMOLLETT":"In March Empire heartthrob Jussie Smollett confirmed that he was gay to Ellen DeGeneres, saying, “there’s never been a closet that I’ve been in.”  Smollett added that, though he wasn’t interested in exposing his private life, he wanted to make a statement “so that people understood that they’re not alone.”  In a case of art imitating life, Smollet’s Empire character, Jamal Lyon, also had a coming out this year, though arguably in a much showier fashion. ","JOEL GREY":"Though Grey had been out to his friends and family for years, the 82-year-old Broadway legend finally made it official in a January interview with People magazine. The Cabaret star confided that he’d been nervous about it his whole life, citing conversations he’d overhear between his parents when he was younger: “[they’d talk] derisively about ‘fairies’ and men being dragged off to jail, and even worse, for being who they were.” ","MILEY CYRUS":"It’s been a big year for Miley, especially in regards to her involvement with the LGBT community: She founded the Happy Hippie Foundation to rally young people to fight the injustices facing homeless and LGBT youth, danced with some of our favorite RPDR queens at the 2015 VMAs and, in August, came out as pansexual   Jerris Madison, Tate Tulier   . “I’m very open about it,” she told Elle UK. “But I’m not in a relationship. I’m 22, I’m going on dates but I change my style every two weeks, let alone who I’m with.” ","SHANE DAWSON":"The 26-year-old YouTube star, who has more than 6.7 million subscribers, came out as bisexual in a teary video confessional in July.  “Over the last year I have been extremely sexually confused,” he explained. “I mean my whole life, but this last year is when it really hit me.” ","ISRAEL GUTIERREZ":"In September, the ESPN commentator came out as both gay and engaged in a moving blog post. “The only way to truly understand [what we go through] is to live in our shoes, which is impossible. Short of that, sharing our experiences is the best way to potentially break through and help people understand.”  Two weeks after posting his statement online, Gutierrez and fiance David Kitchen tied the knot. ","KEEGAN HIRST":"Hirst made headlines in August when he came out as the first openly gay British rugby player. The team captain and father of two admitted that the biggest roadblock to the acceptance of his sexuality was a deeply-embedded cultural denial: “Society dictates that when you’re a 16-year-old lad you have a girlfriend, you sleep with her and that’s how it is. Especially as a rugby player and a lad who grew up on a council estate… I convinced myself, no way could I be gay, it was inconceivable.” But now that he’s embraced his true self, Hirst feels as though he’s “letting out a long breath that [he’s] held in for a long time.” ","JANAE KROC":"The world record-holding bodybuilder came out as a trans woman on Istagram, describing her identity as “Alpha male/girly girl Lesbian in a male body”. Though she hasn’t decided yet if she’s going to fully transition and live her life as a woman, she’s boldly accepting her trans identity while shutting down naysayers who assumed her instagram post was a hoax: “This is really me and yes I am transgender…one does not ’become’ transgender, you are or you aren’t.” ","NYLE DIMARCO":"The America’s Next Top Model recently announced on Twitter that he was sexually fluid. While we realize that doesn’t really increase our chances of making him our boyfriend, we still welcome him to the family.","MR. SMITHERS":"It was announced last month that the beloved Simpsons  sycophant would come out in a two-part episode this season. Even Maggie saw that one coming. ","CHARLIE CARVER":"The Teen Wolf actor started 2016 with a bang, coming out in an Instagram post in January. “So now, let the record show this: I self-identify as gay,” he wrote. “I owe it to myself, more than anything, to be who I needed when I was younger,” he wrote in a message that spanned five different posts.      He admitted he worried being out would “be limiting myself to a type, to a perception with limits that I was not professionally comfortable with,” but, with some guidance, realized that didn’t have to be the case. He closed out his note with a nod to bro Max: “Let the record show my twin brother is just as cool for being straight.” ","KRISTEN STEWART":"Stewart and Twilight co-star Robert Pattinson were one of Hollywood’s power couples in the mid-2000s. But she’s been dating Alicia Cargile since July, telling Elle UK, “Right now, I’m just really in love with my girlfriend.” “To hide this provides the implication that I’m not down with it or I’m ashamed of it,” she added, “so I had to alter how I approached being in public. It opened my life up and I’m so much happier.”","AUBREY PLAZA":"Plaza, a.k.a. April Ludgate on Parks and Recreation, came out as bisexual in an Advocate interview from July. Commenting on her “masculine” energy,” she said, “Girls are into me—that’s no secret. Hey, I’m into them, too. I fall in love with girls and guys. I can’t help it.”  The 32-year-old actress credited having gay relatives—including her aunt, uncle and sister—with teaching her early on that it was okay “to stand out and let your freak flag fly.” ","TREY PEARSON":"Pearson, frontman of the Christian rock band Everyday Sunday, came out in May, publishing an open letter to fans about how his decision to live openly relates to his faith. “I never wanted to be gay,” he wrote. “I was scared of what God would think and what all of these people I loved would think about me; so it was never an option for me.” He described how he married his wife, Lauren, believing he could simply will his homosexuality away.    ABC   “Trying not to be gay, has only led to a desire for intimacy in friendships which pushed friends away, and it has resulted in a marriage where I couldn’t love or satisfy my wife in a way that she needed.” (The two are now close friends.)  He said he’s come out publicly to help foster change in the church.  “It’s not just me,” he added. “There are millions of people going through what I’m going through right now.” ","BELLA THORNE":"The 18-year-old former Disney star might have set a record for shortest coming out annoucement. After a Snapchat surfaced of her kissing Bella Pendergast went viral, a fan asked “are you bisexual?” on Twitter. Her reply? “Yes.”","COLTON HAYNES":"After dancing around the issue with some coy social media messages, 27-year-old Haynes came out in a May interview with EW. “People want you to be that GQ image that you put out, but people don’t realize what it’s like to act 24 hours a day. I’d go home and I was still acting,” he said.     Instagram   “People who are so judgmental about those who are gay or different don’t realize that acting 24 hours a day is the most exhausting thing in the world.” The actor, who has grappled with anxiety and depression, revealed that he was told his father committed suicide after he heard Haynes was gay.","LILLY WACHOWSKI":"One half of the acclaimed filmmaking Wachowski siblings (Bound, The Matrix trilogy, Sense8),  Lilly came out as a trans woman in March, four years after her sister Lana had done the same.      Lilly’s acknowledgement, however, was predicated by media outlets threatening to out her against her will. “I knew at some point I would have to come out publicly,” she explained in a statement.  “You know, when you’re living as an out transgender person it’s… kind of difficult to hide. I just wanted—needed some time to get my head right, to feel comfortable. But apparently I don’t get to decide this.” Nick Adams, GLAAD’s Director of Programs for Transgender Media, insisted “journalists must learn that it is unacceptable to out a transgender person, in the same way it is unacceptable to out a person who is gay, lesbian, or bisexual.” The Wachowski’s most recent project, Sense8, presented a broad spectrum of gender and sexuality. It returns in December.","HOLLAND TAYLOR":"If you’re going to come out as dating a woman, having it be one of the most beautiful and talented women in Hollywood is a good way to go.  Taylor discussed her relationship with Emmy winning actress Sarah Paulson last December.  “There’s a very big age difference between us which I’m sure shocks a lot of people, and it startles me,” Taylor teased, “But as they say, ’If she dies, she dies.’”    Getty Images   Taylor seems blissfully happy but isn’t in any rush to put a ring on it. “Given my generation, [marriage] would not be something that would automatically occur to me,” she said. “[But] just from a spiritual point of view, from a heart point of view… as a deed that has a very rich symbolic gesture to it, it has its attraction.”","SARA RAMIREZ":"Less than a week before National Coming Out Day, the Grey’s Anatomy actress came out as bisexual during an speech at the True Colors: 40 to None Summit on LGBT youth homelessness.  “Because of the intersections that exist in my own life: Woman, multi-racial woman, woman of color, queer, bisexual, Mexican-Irish American, immigrant, and raised by families heavily rooted in Catholicism on both my Mexican and Irish sides,” she said, “I am deeply invested in projects that allow our youth’s voices to be heard.”","ROBIN LORD TAYLOR":"The Gotham actor had kept a low profile about his personal life until this June, when he tweeted in celebration of his fifth wedding anniversary to his husband.      Sadly, while got many well wishes, he also got some ugly remarks. That those remarks came just days after the horrific tragedy in Orlando made it all the harder to stomach.     ","JUSTINE GREENING":"Greening, Education Secretary under British PM Theresa May, came out during London Pride, tweeting “Today’s a good day to say I’m in a happy same-sex relationship. I campaigned for ’Stronger In’ but sometimes you’re better off out! #Pride2016”  Greening was previously Secretary of State for International Development and became the first out cabinet minister in the UK. Her announcement received an outpouring of love from constituents and colleagues, including former Prime Minister David Cameron and Chancellor George Osborne.  Greening’s announcement fit in perfectly with Pride London’s theme of “No Filter.”","ELIZABETH GILBERT":"Earlier this year Gilbert, the celebrated author of Eat, Pray, Love, announced her relationship with Brazilian businessman José Nunes—called “Felipe” in the 2006 memoir—was over.  She’d fallen in love with a woman: Syrian-born filmmaker Rayya Elias, a longtime friend recently diagnosed with pancreatic and liver cancer.     Facebook   “Death—or the prospect of death—has a way of clearing away everything that is not real,” she wrote on Facebook, “and in that space of stark and utter realness, I was faced with this truth: I do not merely love Rayya; I am in love with Rayya. And I have no more time for denying that truth.” She chose to go public with the relationship—and Elias’ diagnosis—because she needed to live in truth “even more than I need privacy, or good publicity, or prudence, or other people’s approval or understanding.”","REID EWING":"Best known as Haley’s boyfriend Dylan on Modern Family, Ewing actually came out while discussing a more serious matter: His battle with body dysmorphia and cosmetic surgery addiction. “I genuinely believed if I had one procedure I would suddenly look like Brad Pitt,” he wrote on HuffPo.    ABC   One became more, and Ewing detailed the procedures he had over several years—from implants, fillers, injections. The 27-year-old actor, who has also appeared in Fright Night, The Truth Below and 10 Rules for Sleeping Around, turned to less and less reputable doctors, who were being sued repeatedly and making up lawyers’ fees with sheer volume. “My history with eating disorders and the cases of OCD in my family never name up,” he said, adding, “I think people often choose cosmetic surgery in order to be accepted, but it usually leaves them feeling even more like an outsider. ","BRIAN ANDERSON":"The legendary skateboarder spoke about his sexuality for the first time in on an episode of Vice Sports’ Reda for the World with Giovanni Reda. “People ask, ’Why are you doing this now and not earlier?'” he confessed. “Because I was pretty freaked out, you know what I mean? I was really scared, and people would have perceived it a lot differently, I think, had I said this 15 years ago.”    Ed Templeton   Anderson was able to slip by because he was, in his words “a big, tough skateboarder,” adding his fellow skaters “weren’t gonna question that… Nobody thought anything.” He says carrying the secret of his sexuality may have pushed him to take more risks on his board. “A part of me was so irritated and angry from holding that in so it made me more of an animal on my skateboard.” ","ELENA DELLE DONNE":"As if playing in the Olympics this summer wasn’t exciting enough, 26-year-old WNBA champ Elena Delle Donne came out to Vogue magazine, announcing her engagement to girlfriend Amanda Clifton.  “They came into my home, spent a couple days with me—and [my fiancee] Amanda is a huge part of my life,” said Delle Donne, an MVP with the Chicago Sky. “To leave her out wouldn’t have made any sense. It’s not a coming out article or anything. I’ve been with her for a very long time now, and people who are close to me know that, and that’s that.” ","":"The X Games champion shared his truth in a ESPN magazine story last October, becoming one of the first extreme sports stars to come out.  He had put off coming out over fear his hometown would turn its back on him, that sponsors would drop him, and friends and family would turn him away. He was so certain, in fact, that he contemplated taking his own life.    Getty   Kenworthy earned a silver medal at the 2014 Winter Games, but says “I never got to be proud of what I did  in Sochi because I felt so horrible about what I didn’t do.” He says he knew he was gay well before he started competing at age 15, but even the “alternative” sport of free skiing urges athletes to fit the mold of the skirt-chasing bro.  “I don’t want to make skiing less cool,” Kenworthy told the magazine. “I want to be the guy who comes out, wins shit and is like, ’I’m taking names.’”","BRANDON FLYNN":"In September, the 13 Reasons Why actor identified himself as part of the LGBT community in an Instagram post.  Addressing a pilot who had written “Vote No” in skywriting over Sydney during the survey on marriage equality in Australia, Flynn wrote, “Too many of my friends have been kicked out of their homes, kept in the closet, beat up, killed, ridiculed by church and state, institutionalized. And you are scared that if we vote YES, you won’t be able to show your hate for us. Fuck that.” “We’ve fought, we’ve come out bravely even in our fear, and you wrote a message in the sky because you’re scared,” he added. “Equality takes courage, it worries me that too many people in this world lack the balls to stand up for what is right.” Since then, the 23-year-old has been seen getting close with Grammy-winning singer Sam Smith.","ALIA SHAWKAT":"The Arrested Development star came out casually in a May interview with Out magazine.  “I was a tomboy growing up, and I remember my mom asking me when I was 10, ’Are you attracted to boys or girls?’ I said I don’t know,” . Now I consider myself bisexual, and I think balancing my male and female energies has been a big part of me growing as an actor.” She admits that she used to more reserved, “but as a woman, an Arab-American, and a member of the LGBTQ community, I have to use whatever voice I have. There’s no more delicacy in being quiet.”","AARON CARTER":"In August, the former child star came out as bi in an emotional message on Twitter. “I grew up in this entertainment industry at a very young age and when I was around 13-years-old I started to find boys and girls attractive,” he wrote. “There were years that went by that I thought about, but it wasn’t until I was 17-years-old, after a few relationships with girls, I had an experience with a male that I had an attraction to who I also worked with and grew up with.” Carter insisted his sexuality wasn’t a source of shame for him, but the secret it was “a burden I have held onto for a long time that I would like lifted off me.” ","THOMAS DEKKER":"The Heroes actor came out in July in an Instagram post where he declared, “I am indeed a man who proudly loves other men. In fact, this April, I married my husband and I could not be happier.”  But in the same post, Dekker blamed “a prominent gay man” for trying to out him. “My sexual orientation once again came into question this week when a prominent gay man used an awards acceptance speech to ‘out’ me,” he wrote. “While he did not mention me by name, the explicit details of his reference made it easy for the public and media to connect the dots.”  It’s believed Dekker was referring to Heroes producer Bryan Fuller, who had recently discussed the difficulty he had in introducing a gay character on the show. As recently as 2011, Dekker told Out, “I’ve only really had relationships with women.”","DAN AMBOYER":"The hunky Younger actor came out to People magazine in October, explaining it was his recent marriage to boyfriend Eric Beric that fueled his desire to be more open.  “I want to live my life moving forward with integrity and pride,” the 31-year-old said. “We might start a family one day and I would feel so strangely if I didn’t celebrate that with all of my family and friends and share that with the fans. This is just the beginning of a wonderful future.” Amboyer admitted that he got a lot of advice from industry insiders to stay closeted. “That was hard to live with,” he said. “But I’ve never played a gay role before and I didn’t want to be limited by some strange perception.” ","ANTHONY BOWENS":"Pro wrestler Anthony Bowens came out as bisexual in March, crediting a YouTube video for giving him the courage to be his authentic self.  Several months into dating boyfriend Michael Pavano, the two participated in YouTube’s “laughing challenge,” in participants take a big swig of water before watching funny clips and trying not to do a spit-take. At the beginning of the video, Pavano casually introduced Bowens as “my boyfriend.” “The video was a blast to do, but I worried that someone from the wrestling world would stumble across it and learn my secret,” Bowens said. “I decided to let it be posted anyway. I couldn’t help but cry as I let loose all of the years of stress, anxiety and fear of judgment. It was the best decision I had ever made.” Several months later, in an interview on Party Foul Radio with Pollo & Pearl, he admitted he was fed up with bi stigma. “I thought there would be more negativity around the stigma of [a pro wrestler] being part of the LGBT community,” Bowens revealed, but most of the negative comments were from people assuming he was too scared to admit he was gay. “You can date a dude or marry a dude and be with him the rest of your life, and that doesn’t change the attraction,” he said. “The LGBTQ community comes in all shapes and sizes.” ","JORDAN GAVARIS":"Gavaris plays gay BFF Felix on Orphan Black, but it wasn’t until June that the 27-year-old came out as gay in real life. “Nobody ever asks me,” he revealed. “I’ve never been asked. Like, the whole course of the series.”  “This is a tricky thing to say and I’ve never actually said it out loud before,” he added. “But I do believe that jobs will be lost and I do believe jobs will be gained. Maybe not even for the right reasons.”","GAVIN RUSSOM":"LCD Soundsystem’s resident electronics whiz came out as trans in July, explaining that over the past year-and-a-half, “I went from my trans identity being something I was in touch with and worked through in one way or another, to suddenly this shift where it’s on the front burner.  She added, “Now it’s time to become a whole person.”","GREYDON CHANCE":"Now 19, Chance became a viral sensation with his performance of Lady Gaga’s “Paparazzi” at a school talent show when he was just 12.  In an Instagram from July, the singer said he had come to terms with being gay when he was 16 but “decided not to publicize my sexuality largely due to a matter of privacy, as I was still trying to find comfort and confidence within my own skin.” While he maintained he was less interested in talking about “what type of guy I was into” than talking about politics, music or art, he “figured now was the time to let a few more friends know that I am happy, I am here for you, and I am proud of who I am.” After his Internet fame, Chance signed to Ellen DeGeneres’ ElevenEleven label and released a debut EP, Somewhere Over My Head, in May 2016. ","BRIAN MICHAEL SMITH":"Smith, who played cis male roles on shows like Blue Bloods, Girls, Person of Interest, and Gossip Girl, came out as transgender when he appeared on an episode of OWN’s Queen Sugar in July, playing police officer Toine Wilkins, a trans man.  “When I saw the breakdown for Toine, I felt this was the role I was looking for,” said Smith, 34. “It was a dream come true in so many ways.” ","SUE BIRD":"This veteran NBA player didn’t just come out in a July ESPN profile, she revealed she was dating soccer star Megan Rapinoe.  “I’m gay. Megan’s my girlfriend,” said the Seattle Storm point guard matter-of-factly. “These aren’t secrets to people who know me. I don’t feel like I’ve not lived my life. I think people have this assumption that if you’re not talking about it, you must be hiding it, like it’s this secret. That was never the case for me.”","SHEPARD SMITH":"The longtime Fox News anchor came out in a subtle way just days after National Coming Out Day 2016.  As the Roger Ailes scandal swirled, Smith denied that the embattled network head forced him to stay in the close. ’That’s not true. He was as nice as he could be to me. I loved him like a father,’ said the 52-year-old newscaster. Back in 2014, Gawker reported Shepard wanted to come out publicly but Ailes stopped him. Smith denied the claim, as well as reports that Ailes made homophobic remarks in his presence.  “He treated me with respect, just respect. He gave me every opportunity in the world and he never asked anything of me but that we try to get it right every day.”","JAKE ZYRUS":"Before coming out as trans on Twitter, Jake was best known as Sunshise Corazon, Rachel Berry’s golden-voiced nemesis on Glee.  “My first tweet as Jake,” he tweeted on June 19. “Overwhelmed. Saw all your love comments and I’m so happy. Finally. I love you, everyone, and see you soon.” A powerhouse vocalist from the Philippines, Zyrus rose to Youtube stardom in 2007. Three years later he became the first Asian solo singer to hit Billboard 200’s Top 10, with the album Charice. Zyrus first acknowledged his gender identity in a 2014 interview with Oprah, in which he said his “soul was male,” though at the time he still identified as a lesbian. ","NATALIE MORALES":"Morales, best known for playing Tom Haverford’s girlfriend Lucy on Parks and Recreation, came out as queer in July. In an essay on Amy Poehler’s Smart Girls website, the 32-year-old explained she has dated both women and men. “I don’t like labeling myself, or anyone else,” she wrote. “But if it’s easier for you to understand me, what I’m saying is that I’m queer. What queer means to me is just simply that I’m not straight. That’s all. It’s not scary, even though that word used to be really, really scary to me.” ","KEIYNAN LONSDALE":"Lonsdale, who plays Kid Flash on the CW’s The Flash, came out as bisexual in a heartfelt Instagram post back in May. “I like to change my hair, I like to take risks with how I dress, I like girls, & I like guys (yes),” wrote the 25-year-old Australian actor—who’s also appeared in ABC’s Dance Academy, The Divergent Series: Insurgent, and The Finest Hours. “I like growing, I like learning, I like who I am and I really like who I’m becoming.”  “I’m tire of being insecure, ashamed and scared,” he added. “No one should feel like that about themselves, especially when there is so much good life to live.” On Twitter, Lonsdale thanked his fans for their support. “Nothing better than happy tears,” he tweeted. “The love is beyond measurable, thank you. Don’t forget to give that same love back to yourselves.” ","BARRY MANILOW":"Manilow addressed his long-rumored sexuality in April, three years after quietly marrying longtime partner and manager Garry Kief. “I thought I would be disappointing [the fans] if they knew I was gay. So I never did anything,” the 73-year-old singer told People. “When they found out that Garry and I were together, they were so happy. The reaction was so beautiful. Strangers commenting, ’Great for you!’ I’m just so grateful for it.”    Steve Granitz/Getty Images   The couple first met in 1978, an encounter the “Copacabana” singer said changed his life forever. “I knew that this was it,” he said. “I was one of the lucky ones. I was pretty lonely before that.” The couple finally tied the knot after nearly 35 years in a private ceremony in April 2014 at the singer’s Palm Springs estate. ","ILOVEMAKONNEN":"This rising hip-hop star came out as gay in January in a series of tweets.  The “Club Goin Up On A Tuesday” singer seemed to be addressing a personal situation, writing, “Someone said to me next time they see me, they was gonna fuck me, I said next time I see me, I’m gonna love me up.” “I can’t tell u about everybody else’s closet, I can only tell u about mine, and it’s time I’ve come out,” he added in followup tweets. “Since y’all love breaking news, here’s some old news to break: I’m gay. And now I’ve told u about my life, maybe u can go life yours” The Atlanta rapper finished his coming-out social media blitz with an Instagram reading “Thank you for letting me be myself.” ","TAYLOR BENNETT":"The brother of Chance the Rapper, Bennett came out as bisexual in January just days before iLoveMakonnen.  “My birthday is tomorrow and moving into next year I’d like to be more open about myself to help others that struggle with the same issues,” he wrote on Twitter. “Growing up I’ve always felt indifferent about my sexuality and being attracted to one sex. And today I would like to openly come out to my fans. I do recognize myself as a bisexual male and I do and have always openly supported the gay community and will keep doing so in 2017.”","STEVE LACY":"The 19-year-old member of the Internet has produced tracks for Kendrick Lamar and Vampire Weekend, and launched his debut solo record, Steve Lacy’s Demo this year. Lacy opened up about his sexuality this summer in a series of Tumblr posts: Asked if he was straight or bisexual, he replied “I’m human.” In a followup asking if he’d date a guy, Lacy replied “Sure, why not.” But he sparked controversy when he revealed that he has no interest in black men as romantic partners. “The reason for it all isn’t anti-black at all,” he replied. “Growing up around black males, they were always my competitors ya know? I never viewed or saw myself doing anything sexual with my neighbors. I literally, like I said, see them as brothers.” Lacy clarified that he didn’t “dislike” black people, “I’m just not attracted to black boys, that is it.” On Twitter, he suggested, “let’s delete the whole closet concept and just let kids be themselves without having to announce what/who they’re into sexually.” ","TYLER, THE CREATOR":"Though he’s been accused of homophobia throughout his career—2011’s Goblin had 213 instances of the word “fag” and other anti-gay slurs—Tyler has also dabbled with gay innuendo.  His album Flower Boy leaked two weeks before its official July 21 release, and the song “I Ain’t Got Time!” includes the lines, “Next line will have ’em like ‘Whoa’/I been kissing white boys since 2004.” Just a few weeks later he told Koopz Tunes, “I had a boyfriend when I was 15 in fucking Hawthorne. If that’s not open-minded, I don’t know what the fuck that is.” Tyler has insisted that his gay fans don’t take offense at his language, and he even put out a line of Pride T-shirts in 2015 as part of his crew Odd Future’s merchandise. When Frank Ocean came out publicly, Tyler was among the first to congratulate him.  “My big brother finally fucking did that,” he tweeted. “Proud of that n*gga cause I know that shit is difficult.”","GORDON THOMSON":"Though best known for the 1980s nighttime soap Dynasty, Thomson didn’t come out until September, opening up about his struggle with his sexuality to the Daily Beast.  “It was not until I was nearly 30 that [homosexuality] stopped being classified as a mental illness in the U.S. So you’re dealing with that. And the shame, the breathtaking lack of self-esteem, has only just begun to seep out of my soul.”","HAAZ SLEIMAN":"In August Sleiman (Nurse Jackie,  The Ski Trip) came out rather bluntly on social media. “I am a gay, Muslim, Arab-American man,” he said in a video. “And I’m going to take it even further: Not only am I gay, but I’m also a bottom. Not only am I a bottom, but I’m also a total bottom—which means I like it up you-know-where.” “And I say this to all the homophobes living in the United States of America and across the globe,” Sleiman, 41, continued. “If you ever come to me, to kill me just because I’m gay, I will destroy you. I might be gay and I might be a nice guy, but don’t get it twisted because I will fuck you up.” ","GIA GUNN":"The former Drag Race contestant came out as trans in March on International Transgender Day of Visibility.  “I thought I would dedicate today in the spirit of being visible to share my transition with all of you,” Gunn revealed in an Instagram video. “I have been on hormone replacement therapy for about a year and I identify as female and I am indeed transgender.” Gunn joins fellow transgender Drag Race contestants Sonique, Carmen Carrera, Jiggly Caliente and Peppermint.","CODY ALAN":"The CMT host came out as gay in January, telling People, “once I realized it was okay to accept the truth, that it wasn’t my choice, it was a lot easier to start figuring out where to go with my life next.”  The 44-year-old South Carolinian hosts a variety of CMT radio shows, including CMT After MidNite and CMT All Access, as well as CMT’s signature music show, Hot 20 Countdown. Alan was previously married to a woman and has teenage children.  “It’s awesome now because I have a partner, my ex has a boyfriend,” he explained. “And with our kids, we have this really beautiful, blended, loving, modern family that works for us.” ","TEDDY GEIGER":"Geiger, a major lyricist in today’s popular music scene, came out as transgender in the comments section of an Instagram post this October.  The music maven is something of a behind-the-scenes player, penning chart-topping singles for stars like One Direction and Shawn Mendes. (Geiger started out as a recording artist, making it big with the 2006 hit “For You I Will (Confidence).”) “Love it or hate it, this is who I’ve been for a long time,” Geiger wrote. ","LIL PEEP":"Lil Peep came out as bisexual on Twitter, less than three days after Aaron Carter came out as bisexual, too. Sadly, the 21-year-old rapper died this November. Police are currently investigating his death, originally suspected to be an overdose, following the discovery of “troubling private messages” on his phone. “I am shocked and heartbroken,” Sarah Stennett, CEO of First Access Entertainment, who worked with Lil Peep, told People magazine. “I do not believe Peep wanted to die, this is so tragic. He had huge ambition and his career was flourishing… I have spoken to his mother and she asked me to convey that she is very, very proud of him and everything he was able to achieve in his short life.” ","RUTINA WESLEY":"The True Blood and Queen Sugar star came out in the most exciting way possible: by announcing her engagement to fiancée Chef Shonda, a New Orleans-based chef. “You are the sunshine of my life…” Wesley wrote on Instagram in reference to Shonda. Awww! ","PEPPERMINT":"The fabulous RuPaul’s Drag Race Season 9 alum came out publicly as a transgender woman earlier this year, making her the show’s first openly trans contestant.  She was embraced by her Drag Race co-stars, she told NewNowNext: “Any anxiety I had beforehand melted away… For Ru and the judges it was a total non-issue. I felt totally loved and accepted. Can I get an amen?” You sure can, girl! ","HANNE GABY ODIELE":"Odiele is a stunning runway model who came out as intersex earlier this year. With a slew of credentials under her belt, including walks in shows for Chanel, Dior, and Alexander Wang, Odiele is no stranger to the pressures of the fashion industry to conform. Regardless, the fierce advocate decided to use her voice to spread the word about the perils intersex people face, including non-consensual genital surgeries as children. “I feel humbled and privileged to use my platform as model to give a voice to other intersex people across the globe who have felt they have no voice,” Odiele told NewNowNext for Intersex Awareness Day this October. “I’ll continue to speak out on this issue and work to persuade the world that intersex people deserve protection, love, and acceptance. ","LAUREN JAUREGUI":"The Fifth Harmony songstress penned an open letter to Trump supporters earlier this year, which included her coming out as bisexual. “I am a bisexual Cuban-American woman and I am so proud of it,” Jauregui wrote. “I am proud to be part of a community that only projects love and education and the support of one another.” “I am proud to be the granddaughter and daughter of immigrants who were brave enough to leave their homes and come to a whole new world with a different language and culture and immerse themselves fearlessly to start a better life for themselves and their families.” ","DANIEL NEWMAN":"The Walking Dead and Dark Knight Rises actor opened up about his bisexuality in March. “I don’t want to be hidden and have to dodge the question,” he told People magazine. “I’m proud of who I am.” Newman admits he was hesitant to talk about his private life, but says he later realized, “’You know what, this is something that everyone should be comfortable with, being 100% themselves and authentic.'” Props to you! ","TEDDY QUINLIVAN":"At 23 years old, this show-stopping model has walked in over 150 runway shows for household names like Marc Jacobs and Louis Vuitton. This September, she came out publicly as trans.  Her announcement was a direct response to the current administration’s political climate: Quinlivan wanted to use her platform as a public figure for good. “Enough is enough,” Quinlivan told CNN. “We deserve justice, and I will use my voice to help our diverse, vibrant and resilient trans communities overcome these obstacles and thrive.” ","SHANNON PURSER":"One of the breakout stars of Netflix’s Stranger Things, Purser came out publicly as bisexual on Twitter. “Getting comfortable with your sexuality is a process,” she wrote. “It’s going to be okay. I wish I’d known that sooner… I know what it’s like to have anxiety about it. Especially trying to come to terms with it and my faith.” Purser’s role as Barb on the Netflix Original series earned her an Emmy nomination. Now, the actor appears in the CW’s Riverdale. ","KEVIN SPACEY":"The Hollywood star came out as gay amid accusations of sexually assaulting a 14-year-old 30 years ago. Spacey promptly fell from grace, with everyone from Zachary Quinto to GLAAD expressing their distaste at the actor’s appallingly poor timing. "}